### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [286]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [287]:
#retrieve the csv file and read the headings.
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [288]:
 #LIST of unique players in an array
uniqueplayerlist = purchase_data["SN"].unique()
uniqueplayerlist

array(['Lisim78', 'Lisovynya38', 'Ithergue48', 'Chamassasya86',
       'Iskosia90', 'Yalae81', 'Itheria73', 'Iskjaskst81', 'Undjask33',
       'Chanosian48', 'Inguron55', 'Haisrisuir60', 'Saelaephos52',
       'Assjaskan73', 'Saesrideu94', 'Lisassa64', 'Lisirra25',
       'Zontibe81', 'Reunasu60', 'Chamalo71', 'Iathenudil29',
       'Phiarithdeu40', 'Siarithria38', 'Eyrian71', 'Siala43',
       'Lisirra87', 'Lirtossa84', 'Eusri44', 'Aela59', 'Tyida79',
       'Idai61', 'Farusrian86', 'Aeralria27', 'Haillyrgue51', 'Sondim73',
       'Jeyciman68', 'Idaisuir85', 'Seuthep89', 'Reulae52',
       'Sondilsaya62', 'Aerithriaphos45', 'Assosia88', 'Aidaillodeu39',
       'Aelly27', 'Tyeosri53', 'Haerith37', 'Yasrisu92', 'Chanuchi25',
       'Asur96', 'Iaralrgue74', 'Chanosia34', 'Aelin32', 'Ilosianya35',
       'Zhisrisu83', 'Phaelap26', 'Raesty92', 'Palyon91', 'Tyisur83',
       'Yaliru88', 'Yadanu52', 'Jiskimya77', 'Yadaphos40', 'Alo38',
       'Phaena87', 'Chamirraya83', 'Chanastsda67', 'Indonmol95',
       'Jiskossa61', 'Pheodai94', 'Hari50', 'Marilsa69', 'Assistasda42',
       'Lisosia93', 'Philodil43', 'Mindadaran26', 'Lirtosia63',
       'Assjaskan56', 'Irithlis29', 'Heudai45', 'Haerithp41', 'Aina42',
       'Jiskjask60', 'Umolrian85', 'Qarirwen82', 'Laedallo55',
       'Eoralrap26', 'Undosian34', 'Chadolyla44', 'Chadistaya75',
       'Yathedeu43', 'Aina43', 'Ilassast39', 'Lisassala98', 'Aiduecal76',
       'Chadossa89', 'Pheodaisun84', 'Heollyriap59', 'Maropast28',
       'Frichim77', 'Thryallym62', 'Eulanurin88', 'Lassjaskan73',
       'Tyaerith73', 'Sondadarya58', 'Hirirap39', 'Ririp86', 'Sundim98',
       'Iskichinya81', 'Phyali88', 'Undirrala66', 'Nitherian58',
       'Lassilsala30', 'Frichaststa61', 'Frichosia58', 'Ilosia37',
       'Lisista27', 'Seudaillorap38', 'Aesty53', 'Yathecal82',
       'Lisossanya98', 'Iral74', 'Lisast87', 'Maridisya31', 'Jiskassa76',
       'Ethriel85', 'Iskirra45', 'Iri67', 'Rarallo90', 'Lisasi93',
       'Adastirin33', 'Eyista89', 'Ili43', 'Chamirra53', 'Hailaphos89',
       'Iskadarya95', 'Qilatista90', 'Inasti31', 'Marilsanya48',
       'Marjask87', 'Chanjaskan89', 'Hyaduesu61', 'Aillyrin83',
       'Marast30', 'Sundadar27', 'Tyaelorap29', 'Lirtimst73',
       'Styaduen40', 'Sidap51', 'Chanastst38', 'Lirtassa52', 'Sondim68',
       'Aeral97', 'Heosurnuru52', 'Lisopela58', 'Caesrinusuir82',
       'Tyirinu79', 'Fironon91', 'Lassjask63', 'Indcil77', 'Chamimla73',
       'Syathe73', 'Baelollodeu94', 'Mindista32', 'Saena74',
       'Marirrasta50', 'Lamil79', 'Aenarap34', 'Aisur51', 'Thrientossa55',
       'Chadista79', 'Tyeurith29', 'Malunil62', 'Hiasri33', 'Lisadar44',
       'Frichjask31', 'Lisjaskya84', 'Ristydru66', 'Frichast28',
       'Minduri31', 'Maradaran90', 'Mindetosya30', 'Ialallo29',
       'Pheusrical25', 'Chanosia60', 'Phistym51', 'Aelollo59',
       'Chamimla85', 'Haisurra41', 'Sondastsda82', 'Qilanrion65',
       'Eulasuir89', 'Eosrirgue62', 'Shaidanu32', 'Lirtastan49',
       'Iaralsuir44', 'Tyeudariasuir90', 'Cosadar58', 'Aelastirin39',
       'Aidai53', 'Jiskjask85', 'Ealrion88', 'Chamjask73', 'Tyaenasti87',
       'Alim85', 'Haeladil46', 'Jiskirran77', 'Undosia27', 'Peorith44',
       'Yarithsurgue62', 'Taeduenu92', 'Rairin89', 'Aerithriaphos46',
       'Idairin51', 'Lisista54', 'Eodailis27', 'Lirtastsda29',
       'Undilsan50', 'Eodaisu60', 'Quaranmol58', 'Lirtossa60',
       'Lirtilsa71', 'Isursuir31', 'Sundirrala66', 'Saerallora71',
       'Iasur80', 'Tyaelo67', 'Quanunwen42', 'Yasur35', 'Assehoan67',
       'Haellysu29', 'Saida58', 'Chamadar79', 'Aeral43', 'Lirtirra37',
       'Tyidaim51', 'Lassassast73', 'Assassasta79', 'Heollyra92',
       'Anallorgue57', 'Aerithllora36', 'Smaistysu35', 'Ennalmol65',
       'Yarithrgue83', 'Yana46', 'Sondimla25', 'Aidai61', 'Wailin72',
       'Firan91', 'Alaesu91', 'Aellynun67', 'Rilaera56', 'Eulaestira36',
       'Marim28', 'Idastidru52', 'Ilirrasda54', 'Alaephos75',
       'Syalollorap93', 'Minduli80', 'Chanastya70', 'Frichadaran88',
       'Siallylis44', 'Aeri84', 'Iasursti71', 'Mindilsa34', 'Chamastya76',
       'Undirra73', 'Aestysu37', 'Chadadarla74', 'Strithenu87',
       'Iasrira89', 'Ialidru40', 'Tyalaesu89', 'Tyidainu31', 'Lirtilsa72',
       'Undjaskla97', 'Saedaiphos46', 'Aerithnucal56', 'Lisossa46',
       'Layjask75', 'Lisista63', 'Ceoral34', 'Hilaerin92',
       'Chadilsasta32', 'Undassa89', 'Iduenu77', 'Lisosia66',
       'Undimsya85', 'Phaedue89', 'Yadacal26', 'Lisossa25', 'Ilmol66',
       'Yastyriaphos75', 'Hiasurria41', 'Palatyon26', 'Qilalista41',
       'Hada39', 'Chamilsala65', 'Rairith81', 'Ilarin91', 'Ryanara76',
       'Undista85', 'Tyeoralru41', 'Pheosrinudeu70', 'Heuli25',
       'Pheutherin27', 'Chadirra90', 'Ali84', 'Frichjaskan98', 'Malil90',
       'Yarithllodeu72', 'Tyaedainu44', 'Ethron58', 'Eusurdeu49',
       'Saistyphos30', 'Saisrilis27', 'Hallysucal81', 'Ilimya66',
       'Raysistast71', 'Haedairiadru51', 'Tyananurgue44', 'Risty84',
       'Aerillorin70', 'Phistyn52', 'Yalo85', 'Chamirrasya33', 'Hiral75',
       'Isursti83', 'Bartassaya73', 'Aeda94', 'Quinarap53', 'Asur53',
       'Alarap40', 'Sida61', 'Hiarideu73', 'Lassassasda30', 'Ennoncil86',
       'Siralsudeu54', 'Eusri26', 'Ardcil81', 'Marilsasya33', 'Lirtim36',
       'Heunadil74', 'Frichadar89', 'Aesurstilis64', 'Idaidil28',
       'Lisotesta51', 'Lisico81', 'Lisiriya82', 'Siana77', 'Marokian45',
       'Sausosia74', 'Assesi91', 'Eusri70', 'Aisurria69', 'Iarilis73',
       'Raisty38', 'Ilista82', 'Leyirra83', 'Aiduesu86', 'Frichynde86',
       'Hisridru55', 'Chamossa77', 'Irillo49', 'Lirtastsya71',
       'Frichosiala98', 'Qilunan34', 'Quarrion42', 'Aisurdru79',
       'Hiaral50', 'Iarallo65', 'Sondassasya91', 'Chanossast57',
       'Chanjask65', 'Ethralista69', 'Sondistanya61', 'Eudanu32',
       'Euthe35', 'Lassimla92', 'Lisossala30', 'Eulae84', 'Chamadarnya73',
       'Eolan54', 'Assistasda90', 'Ennrian78', 'Undirrasta89',
       'Rianistast50', 'Undare39', 'Adairialis76', 'Aesur96',
       'Tyialisudeu65', 'Arirgue63', 'Sundadarla27', 'Eyircil84', 'Ina92',
       'Lirtistanya48', 'Marassa62', 'Mindossa76', 'Salilis27',
       'Sondossa69', 'Sundjask71', 'Errian63', 'Eurithphos97',
       'Raillydeu47', 'Malon70', 'Jiskimsda56', 'Marughi89', 'Ingatcil75',
       'Chanirrasta87', 'Alaesu77', 'Ermol76', 'Tyeuduen32', 'Firon67',
       'Iadueria43', 'Pheulidil31', 'Eodairu79', 'Frichocesta66',
       'Thourdirra92', 'Chanastnya43', 'Iskim96', 'Eulolis41',
       'Sastydeu50', 'Ilaesudil92', 'Yasur85', 'Aidain51',
       'Aerithnuphos61', 'Yalostiphos68', 'Meosridil82', 'Aillyriadru65',
       'Sally64', 'Lisim51', 'Isurria36', 'Silaera56', 'Leetirraya83',
       'Lirtirra81', 'Eryon48', 'Iana95', 'Sondassan80', 'Chanadar44',
       'Eosurdru76', 'Shidai42', 'Aesri53', 'Syally44', 'Jiskadarst60',
       'Sondadar26', 'Malarrian73', 'Maluncil97', 'Ilunyon70', 'Yadam35',
       'Dyally87', 'Pheosurllorin41', 'Frichaya88', 'Lassadarsda57',
       'Marynde90', 'Isri34', 'Assastnya25', 'Ardonmol96',
       'Lassirrasda85', 'Chadossa56', 'Poshilsa82', 'Yoishirrala98',
       'Sundista37', 'Ilassa51', 'Filurarn35', 'Phaestycal84', 'Irilis75',
       'Aeralstical35', 'Chanirrala39', 'Chanirra79', 'Assirra56',
       'Seolollo93', 'Iathem87', 'Iasurriacal29', 'Lisast98', 'Filrion59',
       'Halaecal66', 'Iskosian40', 'Ilastilis78', 'Seosrim97',
       'Farrian71', 'Rithe53', 'Frichossala54', 'Chamjaskya75',
       'Quanrion96', 'Tyaelaelis94', 'Quanenrian83', 'Chanirra64',
       'Yadaisuir65', 'Syathecal44', 'Arin32', 'Aelaria33', 'Assassa81',
       'Filrion83', 'Eoral49', 'Airi27', 'Eurisuru25', 'Liawista80',
       'Lisirra58', 'Chamadarsda63', 'Haestyphos66', 'Phaedasurap84',
       'Mindimnya67', 'Chadjask85', 'Eustyria89', 'Iskim66', 'Chamast86',
       'Lirtassan78', 'Ethrasyon38', 'Quilassa66', 'Lisassasda39',
       'Mindilsa60', 'Lalossa38', 'Chamistast30', 'Hariphos58',
       'Assilsan72', 'Inasuir29', 'Chanilsasda38', 'Mindesi74',
       'Ililsan66', 'Idacal95', 'Aeral68', 'Tyarithn67', 'Asty82',
       'Yalaeria91', 'Chadjask77', 'Ealiril69', 'Quaecjask96',
       'Firatan58', 'Yarolwen77', 'Tyaelistidru84', 'Yarithrin84',
       'Tyaelly53', 'Phiristi62', 'Ililsasya43', 'Aithelis62',
       'Undotesta33', 'Aelidru27', 'Chanossanya44', 'Maradarnya40',
       'Lisilsa62', 'Saena89', 'Chanilsast61', 'Sundassa93', 'Aidai73',
       'Indirrian56', 'Lisassasta50', 'Iduelis31', 'Chanosiaya39',
       'Assylla81', 'Aidaira26', 'Eudanu84', 'Chamiman85', 'Tyialisti80',
       'Marundi65', 'Eusur90', 'Mindirranya33', 'Phiallylis33', 'Isty55',
       'Frichilsa31', 'Chanista95', 'Aellyria80', 'Rastynusuir31',
       'Iljask75', 'Lisjaskan36', 'Mindjasksya61', 'Frichirranya75',
       'Ilast79', 'Eratiel90', 'Assim27', 'Irith83', 'Ilosian36',
       'Iskossasda43', 'Hala31', 'Jiskjask80', 'Aethedru70', 'Yathecal72',
       'Sisur91'], dtype=object)

In [289]:
 #LENGTH of list of unique players
uniquecount = len(uniqueplayerlist)
uniquecount

576

In [290]:
playercount_df = pd.DataFrame({"Total Players": [uniquecount]})
playercount_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [291]:
#find how many of each item ID are in the list
uniqueitems = purchase_data["Item ID"].value_counts()
uniqueitems.head()

178    12
82      9
108     9
145     9
92      8
Name: Item ID, dtype: int64

In [292]:
#find the length of the uniqueitems list
uniquecount = uniqueitems.count()
# uniquecount = uniqueitems.count()
uniquecount

183

In [293]:
#find the average price of all sold items
averageprice = purchase_data["Price"].mean()
averageprice

3.050987179487176

In [294]:
#find total number of purchases
numofpurchases = purchase_data["Purchase ID"].count()
numofpurchases

780

In [295]:
#find total revenue
revenue = purchase_data["Price"].sum()
revenue

2379.77

In [296]:
#create dataframe, and format
generalsummary_df = pd.DataFrame({"Number of Unique Items": [uniquecount],
                          "Average Price": [averageprice],
                          "Number of Purchases": [numofpurchases],
                          "Total Revenue": [revenue]})
generalsummary_df["Average Price"] = generalsummary_df["Average Price"].map("${:.2f}".format)
generalsummary_df["Total Revenue"] = generalsummary_df["Total Revenue"].map("${:,.2f}".format)
generalsummary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [297]:
#retrieve relevant data columns from original purchase_data file
gendersn_df = purchase_data[["SN", "Gender"]]
gendersn_df.head()

              SN Gender
0        Lisim78   Male
1    Lisovynya38   Male
2     Ithergue48   Male
3  Chamassasya86   Male
4      Iskosia90   Male

In [298]:
#drop all duplicates from gendersn table
genderunique_list = gendersn_df.drop_duplicates()
genderunique_list.head()

              SN Gender
0        Lisim78   Male
1    Lisovynya38   Male
2     Ithergue48   Male
3  Chamassasya86   Male
4      Iskosia90   Male

In [299]:
#count the breakdown between male/female
uniquegendercount = genderunique["Gender"].value_counts()
uniquegendercount

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [300]:
#create an initial dataframe for gender demographics
genderdemographic_df = pd.DataFrame({ "Gender" : uniquegendercount})
genderdemographic_df

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [301]:
#create formula to calculate gender percentage.
# Divide each value within the genderdemographic_df with length of genderunique list
genderperc = (genderdemographic_df["Gender"]/len(genderunique))*100
genderperc

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [302]:
#add the new percentage column onto the exiting genderdemographic_df
#format values
genderdemographic_df["Percentage of Players"] = genderperc
genderdemographic_df["Percentage of Players"] = genderdemographic_df["Percentage of Players"].map("{:,.2f}%".format)

In [303]:
#display table
genderdemographic_df

                       Gender Percentage of Players
Male                      484                84.03%
Female                     81                14.06%
Other / Non-Disclosed      11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [304]:
#create a df that is being grouped by gender
groupedgender = purchase_data.groupby(["Gender"])

In [305]:
#breakdown of sum of purchases by gender group
groupedsum = groupedgender["Price"].sum()
groupedsum

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [306]:
#breakdown of average by gender group
groupedmean = groupedgender["Price"].mean()
groupedmean

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [307]:
#create an initial dataframe to host Purchanse count, Sum and Mean by gender
genderpurchase_df = pd.DataFrame({"Purchase Count" : groupedgender["Gender"].count(),
                                 "Average Purchase Price" : groupedmean,
                                "Total Purchase Value" : groupedsum})
genderpurchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [308]:
#create a formula to calculate gender average purchase total
genderavgtotal = genderpurchase_df["Total Purchase Value"]/genderdemographic_df["Gender"]
genderavgtotal

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [309]:
#add the average gender total to the existing genderpurchase_df
genderpurchase_df["Average Purchase Total per Person"] = genderavgtotal

In [310]:
#format values
genderpurchase_df["Average Purchase Price"] = genderpurchase_df["Average Purchase Price"].map("${:,.2f}".format)
genderpurchase_df["Total Purchase Value"] = genderpurchase_df["Total Purchase Value"].map("${:,.2f}".format)
genderpurchase_df["Average Purchase Total per Person"] = genderpurchase_df["Average Purchase Total per Person"].map("${:,.2f}".format)
genderpurchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [311]:
#retrieve a dataframe with only SN and Age
#remove duplicates from the age_df
age_df = purchase_data[["SN", "Age"]]
uniqueage = age_df.drop_duplicates()
uniqueage.head()

              SN  Age
0        Lisim78   20
1    Lisovynya38   40
2     Ithergue48   24
3  Chamassasya86   24
4      Iskosia90   23

In [312]:
#create bins and labels based on age groups
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
age_groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [313]:
#add a new column that cuts or places each person into different groups
uniqueage["Age Group"] = pd.cut(uniqueage["Age"], bins, labels=age_groups)
uniqueage.head()

C:\Users\Ellaine Ho\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

              SN  Age Age Group
0        Lisim78   20     20-24
1    Lisovynya38   40       40+
2     Ithergue48   24     20-24
3  Chamassasya86   24     20-24
4      Iskosia90   23     20-24

In [314]:
#group the dataframe by "Age Group"
agecount_df = uniqueage.groupby("Age Group")
agecount_df["SN"].count()

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [315]:
#calculate the percentages by age group with SN column label
ageperc = (agecount_df["SN"].count()/len(uniqueage))*100
ageperc

Age Group
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [316]:
#create a dataframe
#format values
agedemo_df = pd.DataFrame({"Total Count": agecount_df["SN"].count(),
                     "Percentage of Players": ageperc})
agedemo_df["Percentage of Players"] = agedemo_df["Percentage of Players"].map("{:,.2f}%".format)

In [317]:
#display the age demographic df
agedemo_df

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [318]:
#with the original dataset, cut or place people in bins/labels
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], bins, labels = age_groups)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [319]:
#organize the dataframe by age group
purchase_data_agedf = purchase_data.groupby("Age Group")
purchase_data_agedf["SN"].count()

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [320]:
#calculate the sum based on age breakdown
agesum = purchase_data_agedf["Price"].sum()
agesum

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [321]:
#calculate the mean based on age breakdown
agemean = purchase_data_agedf["Price"].mean()
agemean

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [322]:
#create an initial dataframe that hosts this information
agepurchase_df = pd.DataFrame({"Purchase Count" : purchase_data_agedf["SN"].count(),
                              "Average Purchase Price" : agemean,
                              "Total Purchase Value": agesum})
agepurchase_df

           Purchase Count  Average Purchase Price  Total Purchase Value
Age Group
<10                    23                3.353478                 77.13
10-14                  28                2.956429                 82.78
15-19                 136                3.035956                412.89
20-24                 365                3.052219               1114.06
25-29                 101                2.900990                293.00
30-34                  73                2.931507                214.00
35-39                  41                3.601707                147.67
40+                    13                2.941538                 38.24

In [323]:
#create formula for average pp. Calculate.
ageaveragepp = purchase_data_agedf["Price"].sum()/purchase_data_agedf["SN"].nunique()
ageaveragepp

Age Group
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [324]:
#add this new information to the dataframe
agepurchase_df["Avg Total Purchase per Person"] = ageaveragepp

In [325]:
#format values and display
agepurchase_df["Average Purchase Price"] = agepurchase_df["Average Purchase Price"].map("${:,.2f}".format)
agepurchase_df["Total Purchase Value"] = agepurchase_df["Total Purchase Value"].map("${:,.2f}".format)
agepurchase_df["Avg Total Purchase per Person"] = agepurchase_df["Avg Total Purchase per Person"].map("${:,.2f}".format)
agepurchase_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [326]:
#group the purchase data now by SN
sngrouped_df = purchase_data.groupby("SN")

In [327]:
#retrieve purchase counts by SN
purchcount = purchase_data["SN"].value_counts()
purchcount.head()

Lisosia93       5
Idastidru52     4
Iral74          4
Pheodaisun84    3
Asur53          3
Name: SN, dtype: int64

In [328]:
#calculate the spender totals
spendertot = sngrouped_df["Price"].sum()
spendertot.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [350]:
#create intiial dataframe that hosts these sum and mean
#sort values, sorting later caused problems
topspender_df = pd.DataFrame({"Purchase Count" : purchcount,
                            "Total Purchase Value" : spendertot})
topspender_df = topspender_df.sort_values("Total Purchase Value", ascending=False)
topspender_df.head()

             Purchase Count  Total Purchase Value
Lisosia93                 5                 18.96
Idastidru52               4                 15.45
Chamjask73                3                 13.83
Iral74                    4                 13.62
Iskadarya95               3                 13.10

In [351]:
#calculate spender mean
spendermean = topspender_df["Total Purchase Value"]/topspender_df["Purchase Count"]
spendermean.head()

Lisosia93      3.792000
Idastidru52    3.862500
Chamjask73     4.610000
Iral74         3.405000
Iskadarya95    4.366667
dtype: float64

In [352]:
#add the new calculation to the table
topspender_df["Average Purchase Price"] = spendermean

In [353]:
# #format values
topspender_df["Average Purchase Price"] = topspender_df["Average Purchase Price"].map("${:,.2f}".format)
topspender_df["Total Purchase Value"] = topspender_df["Total Purchase Value"].map("${:,.2f}".format)

In [354]:
#reorganize data and display
reorganized_topspenderdf = topspender_df[["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]
reorganized_topspenderdf.head()

             Purchase Count Average Purchase Price Total Purchase Value
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [355]:
#create a dataframe with only threee data elements from purchase_data
items_df = purchase_data[["Item ID", "Item Name", "Price"]]
items_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [356]:
#drop item duplicates
uniqueitems_df = items_df.drop_duplicates()
uniqueitems_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [357]:
#group this new dataframe by Item ID and Item Name
itemgrouped_df = items_df.groupby(["Item ID", "Item Name"])

In [358]:
#calculate the occurences of each item ID
itemcounts = purchase_data["Item ID"].value_counts()
itemcounts.head()

178    12
82      9
108     9
145     9
92      8
Name: Item ID, dtype: int64

In [362]:
#create a dataframe to host this data
popularitem_df = pd.DataFrame({"Purchase Count": itemgrouped_df["Item ID"].count()})
popularitem_df.head()

                            Purchase Count
Item ID Item Name
0       Splinter                         4
1       Crucifer                         3
2       Verdict                          6
3       Phantomlight                     6
4       Bloodlord's Fetish               5

In [365]:
#merge the two dataframes together to combine purchase count and price
itemsmaster_df = pd.merge(popularitem_df, uniqueitems_df, on="Item ID", how = "outer")
itemsmaster_df.head()

   Item ID  Purchase Count           Item Name  Price
0        0               4            Splinter   1.28
1        1               3            Crucifer   3.26
2        2               6             Verdict   2.48
3        3               6        Phantomlight   2.49
4        4               5  Bloodlord's Fetish   1.70

In [367]:
#use a formula to calculate total purchase value and display
totalvalue = itemsmaster_df["Purchase Count"] * itemsmaster_df["Price"]
itemsmaster_df["Total Purchase Value"] = totalvalue
itemsmaster_df.head()

   Item ID  Purchase Count           Item Name  Price  Total Purchase Value
0        0               4            Splinter   1.28                  5.12
1        1               3            Crucifer   3.26                  9.78
2        2               6             Verdict   2.48                 14.88
3        3               6        Phantomlight   2.49                 14.94
4        4               5  Bloodlord's Fetish   1.70                  8.50

In [377]:
#reeorganize the dataframe and set index. format values
reorganized_itemsmaster_df = itemsmaster_df[["Item ID", "Item Name", "Purchase Count", "Price", "Total Purchase Value"]]
reorganized_itemsmaster_df = reorganized_itemsmaster_df.set_index("Item ID")

In [381]:
#retrieve most popular by sorting on purchase count
mostpopular_df = reorganized_itemsmaster_df.sort_values("Purchase Count", ascending=False)
mostpopular_df["Price"] = mostpopular_df["Price"].map("${:,.2f}".format)
mostpopular_df["Total Purchase Value"] = mostpopular_df["Total Purchase Value"].map("${:,.2f}".format)
mostpopular_df.head()

,Item Name,Purchase Count,Price,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [382]:
#retrieve most profitable by sorting from purchase value
mostprofitable_df = reorganized_itemsmaster_df.sort_values("Total Purchase Value", ascending=False)
mostprofitable_df["Price"] = mostprofitable_df["Price"].map("${:,.2f}".format)
mostprofitable_df["Total Purchase Value"] = mostprofitable_df["Total Purchase Value"].map("${:,.2f}".format)
mostprofitable_df.head()

,Item Name,Purchase Count,Price,Total Purchase Value
Item ID,,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80